runs/run/fio/rescale/mercury-2-nodes-56gbps/2018-02-26_20:24:02/stdout.txt
WARNING! PPN should be 16 but rescale's mpi implementation doesn't support it!
Using default -machinefile setting (/enc/uprod_wooKp/hosts)
MPI Application rank 15 exited before MPI_Init() with status 0
getbw.value: 19.55
getlat.value: 198.35
log-128m-randread-job.p8510700: 
box.p8510700: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process
box.p8510700: Laying out IO file (1 file / 128MiB)

box.p8510700: (groupid=0, jobs=1): err= 0: pid=7521: Mon Feb 26 17:32:32 2018
   read: IOPS=4742, BW=18.5MiB/s (19.4MB/s)(128MiB/6910msec)
    clat (usec): min=94, max=3922, avg=208.82, stdev=172.04
     lat (usec): min=94, max=3922, avg=209.09, stdev=172.04
    clat percentiles (usec):
     |  1.00th=[  161],  5.00th=[  167], 10.00th=[  178], 20.00th=[  180],
     | 30.00th=[  182], 40.00th=[  184], 50.00th=[  186], 60.00th=[  198],
     | 70.00th=[  202], 80.00th=[  204], 90.00th=[  215], 95.00th=[  243],
     | 99.00th=[  545], 99.50th=[ 1582], 99.90th=[ 2835], 99.95th=[ 2999],
     | 99.99th=[ 3458]
   bw (  KiB/s): min=18304, max=20552, per=99.94%, avg=18956.00, stdev=563.04, samples=13
   iops        : min= 4576, max= 5138, avg=4738.92, stdev=140.75, samples=13
  lat (usec)   : 100=0.01%, 250=95.83%, 500=3.11%, 750=0.28%, 1000=0.14%
  lat (msec)   : 2=0.26%, 4=0.37%
  cpu          : usr=0.00%, sys=5.51%, ctx=32770, majf=0, minf=35
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=32768,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=18.5MiB/s (19.4MB/s), 18.5MiB/s-18.5MiB/s (19.4MB/s-19.4MB/s), io=128MiB (134MB), run=6910-6910msec

Disk stats (read/write):
    dm-1: ios=31654/1210, merge=0/0, ticks=6559/1208, in_queue=7767, util=96.96%, aggrios=32768/1243, aggrmerge=0/0, aggrticks=6620/439, aggrin_queue=7059, aggrutil=94.45%
    dm-0: ios=32768/1243, merge=0/0, ticks=6620/439, in_queue=7059, util=94.45%, aggrios=32768/1243, aggrmerge=0/0, aggrticks=6612/440, aggrin_queue=7045, aggrutil=94.24%
  sdb: ios=32768/1243, merge=0/0, ticks=6612/440, in_queue=7045, util=94.24%
log-128m-randread-job.p8510701: 
box.p8510701: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process
box.p8510701: Laying out IO file (1 file / 128MiB)

box.p8510701: (groupid=0, jobs=1): err= 0: pid=3580: Mon Feb 26 17:32:32 2018
   read: IOPS=5280, BW=20.6MiB/s (21.6MB/s)(128MiB/6205msec)
    clat (usec): min=139, max=1694, avg=187.39, stdev=25.26
     lat (usec): min=139, max=1694, avg=187.61, stdev=25.26
    clat percentiles (usec):
     |  1.00th=[  159],  5.00th=[  167], 10.00th=[  172], 20.00th=[  178],
     | 30.00th=[  182], 40.00th=[  184], 50.00th=[  186], 60.00th=[  188],
     | 70.00th=[  192], 80.00th=[  198], 90.00th=[  200], 95.00th=[  206],
     | 99.00th=[  231], 99.50th=[  255], 99.90th=[  400], 99.95th=[  693],
     | 99.99th=[ 1090]
   bw (  KiB/s): min=20320, max=21384, per=99.95%, avg=21112.67, stdev=280.95, samples=12
   iops        : min= 5080, max= 5346, avg=5278.17, stdev=70.24, samples=12
  lat (usec)   : 250=99.44%, 500=0.50%, 750=0.02%, 1000=0.03%
  lat (msec)   : 2=0.02%
  cpu          : usr=1.31%, sys=2.61%, ctx=32772, majf=0, minf=33
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=32768,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=20.6MiB/s (21.6MB/s), 20.6MiB/s-20.6MiB/s (21.6MB/s-21.6MB/s), io=128MiB (134MB), run=6205-6205msec
WARNING! PPN should be 16 but rescale's mpi implementation doesn't support it!
Using default -machinefile setting (/enc/uprod_wooKp/hosts)
MPI Application rank 14 killed before MPI_Init() with signal 15
getbw.value: 1213.5
getlat.value: 2241.15
log-128m-randwrite-job.p8510700: 
box.p8510700: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.p8510700: (groupid=0, jobs=1): err= 0: pid=7663: Mon Feb 26 17:32:47 2018
  write: IOPS=315k, BW=1231MiB/s (1291MB/s)(128MiB/104msec)
    clat (nsec): min=1500, max=223100, avg=2106.82, stdev=2633.48
     lat (nsec): min=1600, max=234200, avg=2249.20, stdev=2956.24
    clat percentiles (nsec):
     |  1.00th=[  1704],  5.00th=[  1800], 10.00th=[  1800], 20.00th=[  1800],
     | 30.00th=[  1800], 40.00th=[  1800], 50.00th=[  1896], 60.00th=[  1896],
     | 70.00th=[  1896], 80.00th=[  2008], 90.00th=[  2416], 95.00th=[  3696],
     | 99.00th=[  4576], 99.50th=[  5792], 99.90th=[ 40704], 99.95th=[ 45824],
     | 99.99th=[160768]
  lat (usec)   : 2=79.71%, 4=17.39%, 10=2.66%, 20=0.12%, 50=0.10%
  lat (usec)   : 100=0.01%, 250=0.01%
  cpu          : usr=15.53%, sys=84.47%, ctx=1, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,32768,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1231MiB/s (1291MB/s), 1231MiB/s-1231MiB/s (1291MB/s-1291MB/s), io=128MiB (134MB), run=104-104msec

Disk stats (read/write):
    dm-1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%, aggrios=0/28, aggrmerge=0/0, aggrticks=0/26, aggrin_queue=26, aggrutil=6.33%
    dm-0: ios=0/28, merge=0/0, ticks=0/26, in_queue=26, util=6.33%, aggrios=0/28, aggrmerge=0/0, aggrticks=0/26, aggrin_queue=26, aggrutil=6.33%
  sdb: ios=0/28, merge=0/0, ticks=0/26, in_queue=26, util=6.33%
log-128m-randwrite-job.p8510701: 
box.p8510701: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.p8510701: (groupid=0, jobs=1): err= 0: pid=3690: Mon Feb 26 17:32:47 2018
  write: IOPS=306k, BW=1196MiB/s (1254MB/s)(128MiB/107msec)
    clat (nsec): min=1600, max=276200, avg=2091.43, stdev=2897.94
     lat (nsec): min=1800, max=276400, avg=2233.10, stdev=2900.39
    clat percentiles (nsec):
     |  1.00th=[  1704],  5.00th=[  1800], 10.00th=[  1800], 20.00th=[  1800],
     | 30.00th=[  1800], 40.00th=[  1800], 50.00th=[  1896], 60.00th=[  1896],
     | 70.00th=[  1896], 80.00th=[  2008], 90.00th=[  2416], 95.00th=[  2896],
     | 99.00th=[  6432], 99.50th=[  6816], 99.90th=[  9536], 99.95th=[ 11456],
     | 99.99th=[205824]
  lat (usec)   : 2=75.51%, 4=21.37%, 10=3.04%, 20=0.05%, 50=0.02%
  lat (usec)   : 250=0.01%, 500=0.01%
  cpu          : usr=18.87%, sys=79.25%, ctx=3, majf=0, minf=35
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,32768,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1196MiB/s (1254MB/s), 1196MiB/s-1196MiB/s (1254MB/s-1254MB/s), io=128MiB (134MB), run=107-107msec
WARNING! PPN should be 16 but rescale's mpi implementation doesn't support it!
Using default -machinefile setting (/enc/uprod_wooKp/hosts)
MPI Application rank 14 killed before MPI_Init() with signal 15
getbw.value: 650.5
getlat.value: 5805.255
log-128m-read-job.p8510700: 
box.p8510700: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.p8510700: (groupid=0, jobs=1): err= 0: pid=7811: Mon Feb 26 17:33:01 2018
   read: IOPS=223k, BW=871MiB/s (913MB/s)(128MiB/147msec)
    clat (nsec): min=400, max=4818.8k, avg=3315.99, stdev=73016.07
     lat (nsec): min=500, max=4818.9k, avg=3448.86, stdev=73018.48
    clat percentiles (nsec):
     |  1.00th=[    402],  5.00th=[    402], 10.00th=[    402],
     | 20.00th=[    502], 30.00th=[    502], 40.00th=[    502],
     | 50.00th=[    502], 60.00th=[    502], 70.00th=[    604],
     | 80.00th=[    700], 90.00th=[    804], 95.00th=[    804],
     | 99.00th=[   1004], 99.50th=[   5408], 99.90th=[1138688],
     | 99.95th=[1646592], 99.99th=[3293184]
  lat (nsec)   : 500=17.14%, 750=72.21%, 1000=9.13%
  lat (usec)   : 2=1.00%, 4=0.02%, 10=0.09%, 20=0.09%, 50=0.03%
  lat (usec)   : 100=0.01%, 250=0.10%, 500=0.05%, 750=0.01%, 1000=0.02%
  lat (msec)   : 2=0.07%, 4=0.03%, 10=0.01%
  cpu          : usr=4.79%, sys=44.52%, ctx=59, majf=0, minf=39
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=32768,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=871MiB/s (913MB/s), 871MiB/s-871MiB/s (913MB/s-913MB/s), io=128MiB (134MB), run=147-147msec

Disk stats (read/write):
    dm-1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%, aggrios=259/32, aggrmerge=0/0, aggrticks=282/33, aggrin_queue=315, aggrutil=32.95%
    dm-0: ios=259/32, merge=0/0, ticks=282/33, in_queue=315, util=32.95%, aggrios=259/32, aggrmerge=0/0, aggrticks=283/33, aggrin_queue=315, aggrutil=33.33%
  sdb: ios=259/32, merge=0/0, ticks=283/33, in_queue=315, util=33.33%
log-128m-read-job.p8510701: 
box.p8510701: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.p8510701: (groupid=0, jobs=1): err= 0: pid=3778: Mon Feb 26 17:33:01 2018
   read: IOPS=110k, BW=430MiB/s (450MB/s)(128MiB/298msec)
    clat (nsec): min=400, max=5674.4k, avg=8022.20, stdev=141167.37
     lat (nsec): min=500, max=5674.5k, avg=8161.65, stdev=141170.35
    clat percentiles (nsec):
     |  1.00th=[    402],  5.00th=[    402], 10.00th=[    502],
     | 20.00th=[    502], 30.00th=[    502], 40.00th=[    502],
     | 50.00th=[    502], 60.00th=[    502], 70.00th=[    604],
     | 80.00th=[    604], 90.00th=[    604], 95.00th=[    604],
     | 99.00th=[    804], 99.50th=[   2096], 99.90th=[2539520],
     | 99.95th=[3457024], 99.99th=[4358144]
  lat (nsec)   : 500=5.13%, 750=93.63%, 1000=0.39%
  lat (usec)   : 2=0.34%, 4=0.02%, 10=0.04%, 20=0.03%, 50=0.05%
  lat (usec)   : 100=0.02%, 250=0.02%, 500=0.01%, 1000=0.01%
  lat (msec)   : 2=0.17%, 4=0.13%, 10=0.02%
  cpu          : usr=4.04%, sys=18.86%, ctx=114, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=32768,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=430MiB/s (450MB/s), 430MiB/s-430MiB/s (450MB/s-450MB/s), io=128MiB (134MB), run=298-298msec
WARNING! PPN should be 16 but rescale's mpi implementation doesn't support it!
Using default -machinefile setting (/enc/uprod_wooKp/hosts)
MPI Application rank 14 killed before MPI_Init() with signal 15
getbw.value: 1264.5
getlat.value: 2272.37
log-128m-write-job.p8510700: 
box.p8510700: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.p8510700: (groupid=0, jobs=1): err= 0: pid=7936: Mon Feb 26 17:33:15 2018
  write: IOPS=341k, BW=1333MiB/s (1398MB/s)(128MiB/96msec)
    clat (nsec): min=1600, max=222300, avg=2017.79, stdev=2287.75
     lat (nsec): min=1800, max=222400, avg=2153.35, stdev=2291.40
    clat percentiles (nsec):
     |  1.00th=[  1704],  5.00th=[  1704], 10.00th=[  1704], 20.00th=[  1800],
     | 30.00th=[  1800], 40.00th=[  1800], 50.00th=[  1800], 60.00th=[  1800],
     | 70.00th=[  1896], 80.00th=[  1896], 90.00th=[  2288], 95.00th=[  3216],
     | 99.00th=[  4320], 99.50th=[  4704], 99.90th=[  9280], 99.95th=[ 10944],
     | 99.99th=[162816]
  lat (usec)   : 2=82.36%, 4=15.67%, 10=1.88%, 20=0.05%, 50=0.01%
  lat (usec)   : 250=0.02%
  cpu          : usr=22.11%, sys=76.84%, ctx=0, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,32768,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1333MiB/s (1398MB/s), 1333MiB/s-1333MiB/s (1398MB/s-1398MB/s), io=128MiB (134MB), run=96-96msec

Disk stats (read/write):
    dm-1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%, aggrios=0/28, aggrmerge=0/0, aggrticks=0/24, aggrin_queue=24, aggrutil=6.64%
    dm-0: ios=0/28, merge=0/0, ticks=0/24, in_queue=24, util=6.64%, aggrios=0/28, aggrmerge=0/0, aggrticks=0/24, aggrin_queue=24, aggrutil=6.64%
  sdb: ios=0/28, merge=0/0, ticks=0/24, in_queue=24, util=6.64%
log-128m-write-job.p8510701: 
box.p8510701: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.p8510701: (groupid=0, jobs=1): err= 0: pid=3891: Mon Feb 26 17:33:15 2018
  write: IOPS=306k, BW=1196MiB/s (1254MB/s)(128MiB/107msec)
    clat (nsec): min=1700, max=1047.9k, avg=2234.80, stdev=6858.28
     lat (nsec): min=1800, max=1048.1k, avg=2391.39, stdev=6860.43
    clat percentiles (nsec):
     |  1.00th=[  1704],  5.00th=[  1704], 10.00th=[  1800], 20.00th=[  1800],
     | 30.00th=[  1800], 40.00th=[  2008], 50.00th=[  2008], 60.00th=[  2096],
     | 70.00th=[  2096], 80.00th=[  2096], 90.00th=[  2416], 95.00th=[  2992],
     | 99.00th=[  6432], 99.50th=[  7008], 99.90th=[ 11968], 99.95th=[ 14656],
     | 99.99th=[248832]
  lat (usec)   : 2=38.45%, 4=57.99%, 10=3.38%, 20=0.15%, 50=0.01%
  lat (usec)   : 250=0.01%, 500=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=15.89%, sys=81.31%, ctx=3, majf=0, minf=36
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,32768,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1196MiB/s (1254MB/s), 1196MiB/s-1196MiB/s (1254MB/s-1254MB/s), io=128MiB (134MB), run=107-107msec
WARNING! PPN should be 16 but rescale's mpi implementation doesn't support it!
Using default -machinefile setting (/enc/uprod_wooKp/hosts)
MPI Application rank 20 exited before MPI_Init() with status 0
getbw.value: 19.6
getlat.value: 197.575
log-1024m-randread-job.p8510700: 
box.p8510700: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process
box.p8510700: Laying out IO file (1 file / 1024MiB)

box.p8510700: (groupid=0, jobs=1): err= 0: pid=8062: Mon Feb 26 17:34:23 2018
   read: IOPS=4898, BW=19.1MiB/s (20.1MB/s)(1024MiB/53512msec)
    clat (usec): min=83, max=161092, avg=202.59, stdev=369.13
     lat (usec): min=83, max=161093, avg=202.78, stdev=369.14
    clat percentiles (usec):
     |  1.00th=[  153],  5.00th=[  159], 10.00th=[  161], 20.00th=[  167],
     | 30.00th=[  174], 40.00th=[  180], 50.00th=[  184], 60.00th=[  190],
     | 70.00th=[  196], 80.00th=[  202], 90.00th=[  215], 95.00th=[  237],
     | 99.00th=[  453], 99.50th=[ 1319], 99.90th=[ 2868], 99.95th=[ 3064],
     | 99.99th=[ 5800]
   bw (  KiB/s): min= 2616, max=21200, per=100.00%, avg=19600.36, stdev=1771.03, samples=107
   iops        : min=  654, max= 5300, avg=4900.06, stdev=442.76, samples=107
  lat (usec)   : 100=0.01%, 250=96.08%, 500=2.99%, 750=0.24%, 1000=0.11%
  lat (msec)   : 2=0.22%, 4=0.34%, 10=0.02%, 20=0.01%, 50=0.01%
  lat (msec)   : 250=0.01%
  cpu          : usr=0.66%, sys=3.59%, ctx=262146, majf=0, minf=74
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=262144,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=19.1MiB/s (20.1MB/s), 19.1MiB/s-19.1MiB/s (20.1MB/s-20.1MB/s), io=1024MiB (1074MB), run=53512-53512msec

Disk stats (read/write):
    dm-1: ios=261033/8985, merge=0/0, ticks=52736/385754, in_queue=438491, util=98.80%, aggrios=262145/9027, aggrmerge=0/0, aggrticks=51545/58619, aggrin_queue=110163, aggrutil=96.59%
    dm-0: ios=262145/9027, merge=0/0, ticks=51545/58619, in_queue=110163, util=96.59%, aggrios=262145/9027, aggrmerge=0/0, aggrticks=51516/57786, aggrin_queue=109280, aggrutil=96.51%
  sdb: ios=262145/9027, merge=0/0, ticks=51516/57786, in_queue=109280, util=96.51%
log-1024m-randread-job.p8510701: 
box.p8510701: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process
box.p8510701: Laying out IO file (1 file / 1024MiB)

box.p8510701: (groupid=0, jobs=1): err= 0: pid=3983: Mon Feb 26 17:34:22 2018
   read: IOPS=5152, BW=20.1MiB/s (21.1MB/s)(1024MiB/50880msec)
    clat (usec): min=132, max=9755, avg=192.14, stdev=67.27
     lat (usec): min=132, max=9755, avg=192.37, stdev=67.27
    clat percentiles (usec):
     |  1.00th=[  157],  5.00th=[  165], 10.00th=[  169], 20.00th=[  178],
     | 30.00th=[  182], 40.00th=[  186], 50.00th=[  190], 60.00th=[  194],
     | 70.00th=[  198], 80.00th=[  200], 90.00th=[  208], 95.00th=[  217],
     | 99.00th=[  262], 99.50th=[  293], 99.90th=[  865], 99.95th=[ 1336],
     | 99.99th=[ 2900]
   bw (  KiB/s): min=18824, max=22040, per=99.97%, avg=20602.62, stdev=684.78, samples=101
   iops        : min= 4706, max= 5510, avg=5150.63, stdev=171.20, samples=101
  lat (usec)   : 250=98.75%, 500=1.06%, 750=0.07%, 1000=0.03%
  lat (msec)   : 2=0.07%, 4=0.01%, 10=0.01%
  cpu          : usr=0.39%, sys=3.50%, ctx=262149, majf=0, minf=54
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=262144,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=20.1MiB/s (21.1MB/s), 20.1MiB/s-20.1MiB/s (21.1MB/s-21.1MB/s), io=1024MiB (1074MB), run=50880-50880msec
WARNING! PPN should be 16 but rescale's mpi implementation doesn't support it!
Using default -machinefile setting (/enc/uprod_wooKp/hosts)
MPI Application rank 14 killed before MPI_Init() with signal 15
getbw.value: 1179.5
getlat.value: 2279.505
log-1024m-randwrite-job.p8510700: 
box.p8510700: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.p8510700: (groupid=0, jobs=1): err= 0: pid=8573: Mon Feb 26 17:34:36 2018
  write: IOPS=308k, BW=1203MiB/s (1262MB/s)(1024MiB/851msec)
    clat (nsec): min=1600, max=791400, avg=2145.28, stdev=2935.27
     lat (nsec): min=1800, max=791500, avg=2280.62, stdev=3034.55
    clat percentiles (nsec):
     |  1.00th=[  1800],  5.00th=[  1800], 10.00th=[  1800], 20.00th=[  1800],
     | 30.00th=[  1896], 40.00th=[  1896], 50.00th=[  1896], 60.00th=[  2008],
     | 70.00th=[  2008], 80.00th=[  2096], 90.00th=[  2416], 95.00th=[  3792],
     | 99.00th=[  4704], 99.50th=[  5280], 99.90th=[  9920], 99.95th=[ 12352],
     | 99.99th=[181248]
   bw (  MiB/s): min= 1078, max= 1078, per=89.66%, avg=1078.82, stdev= 0.00, samples=1
   iops        : min=276178, max=276178, avg=276178.00, stdev= 0.00, samples=1
  lat (usec)   : 2=57.37%, 4=39.14%, 10=3.39%, 20=0.07%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 1000=0.01%
  cpu          : usr=17.53%, sys=82.24%, ctx=2, majf=0, minf=39
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,262144,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1203MiB/s (1262MB/s), 1203MiB/s-1203MiB/s (1262MB/s-1262MB/s), io=1024MiB (1074MB), run=851-851msec

Disk stats (read/write):
    dm-1: ios=0/92, merge=0/0, ticks=0/153, in_queue=153, util=6.43%, aggrios=0/120, aggrmerge=0/0, aggrticks=0/140, aggrin_queue=140, aggrutil=6.32%
    dm-0: ios=0/120, merge=0/0, ticks=0/140, in_queue=140, util=6.32%, aggrios=0/120, aggrmerge=0/0, aggrticks=0/141, aggrin_queue=141, aggrutil=6.32%
  sdb: ios=0/120, merge=0/0, ticks=0/141, in_queue=141, util=6.32%
log-1024m-randwrite-job.p8510701: 
box.p8510701: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.p8510701: (groupid=0, jobs=1): err= 0: pid=4165: Mon Feb 26 17:34:39 2018
  write: IOPS=296k, BW=1156MiB/s (1212MB/s)(1024MiB/886msec)
    clat (nsec): min=1600, max=917500, avg=2143.13, stdev=4647.06
     lat (nsec): min=1700, max=917600, avg=2278.39, stdev=4721.65
    clat percentiles (nsec):
     |  1.00th=[  1704],  5.00th=[  1704], 10.00th=[  1800], 20.00th=[  1800],
     | 30.00th=[  1800], 40.00th=[  1896], 50.00th=[  1896], 60.00th=[  1896],
     | 70.00th=[  2008], 80.00th=[  2096], 90.00th=[  2416], 95.00th=[  2896],
     | 99.00th=[  6496], 99.50th=[  6880], 99.90th=[ 10048], 99.95th=[ 19072],
     | 99.99th=[234496]
   bw (  KiB/s): min=1006131, max=1006131, per=85.01%, avg=1006131.00, stdev= 0.00, samples=1
   iops        : min=251532, max=251532, avg=251532.00, stdev= 0.00, samples=1
  lat (usec)   : 2=64.82%, 4=31.86%, 10=3.22%, 20=0.05%, 50=0.02%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=16.38%, sys=83.39%, ctx=13, majf=0, minf=36
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,262144,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1156MiB/s (1212MB/s), 1156MiB/s-1156MiB/s (1212MB/s-1212MB/s), io=1024MiB (1074MB), run=886-886msec
WARNING! PPN should be 16 but rescale's mpi implementation doesn't support it!
Using default -machinefile setting (/enc/uprod_wooKp/hosts)
MPI Application rank 14 killed before MPI_Init() with signal 15
getbw.value: 884
getlat.value: 3319.63
log-1024m-read-job.p8510700: 
box.p8510700: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.p8510700: (groupid=0, jobs=1): err= 0: pid=8735: Mon Feb 26 17:34:53 2018
   read: IOPS=226k, BW=884MiB/s (926MB/s)(1024MiB/1159msec)
    clat (nsec): min=300, max=5862.2k, avg=3193.61, stdev=69911.55
     lat (nsec): min=500, max=5862.4k, avg=3319.63, stdev=69912.15
    clat percentiles (nsec):
     |  1.00th=[    402],  5.00th=[    402], 10.00th=[    402],
     | 20.00th=[    402], 30.00th=[    502], 40.00th=[    502],
     | 50.00th=[    502], 60.00th=[    604], 70.00th=[    700],
     | 80.00th=[    700], 90.00th=[    804], 95.00th=[    804],
     | 99.00th=[   1096], 99.50th=[   5472], 99.90th=[1044480],
     | 99.95th=[1728512], 99.99th=[3031040]
   bw (  KiB/s): min=690848, max=1061376, per=96.84%, avg=876112.00, stdev=262002.86, samples=2
   iops        : min=172712, max=265344, avg=219028.00, stdev=65500.72, samples=2
  lat (nsec)   : 500=28.16%, 750=57.91%, 1000=12.22%
  lat (usec)   : 2=1.16%, 4=0.04%, 10=0.10%, 20=0.08%, 50=0.03%
  lat (usec)   : 100=0.02%, 250=0.14%, 500=0.03%, 750=0.01%, 1000=0.02%
  lat (msec)   : 2=0.07%, 4=0.04%, 10=0.01%
  cpu          : usr=7.69%, sys=43.70%, ctx=539, majf=0, minf=39
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=262144,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=884MiB/s (926MB/s), 884MiB/s-884MiB/s (926MB/s-926MB/s), io=1024MiB (1074MB), run=1159-1159msec

Disk stats (read/write):
    dm-1: ios=2029/148, merge=0/0, ticks=4635/298, in_queue=4941, util=76.60%, aggrios=2054/152, aggrmerge=0/0, aggrticks=2410/216, aggrin_queue=2626, aggrutil=53.02%
    dm-0: ios=2054/152, merge=0/0, ticks=2410/216, in_queue=2626, util=53.02%, aggrios=2054/152, aggrmerge=0/0, aggrticks=2415/217, aggrin_queue=2631, aggrutil=52.94%
  sdb: ios=2054/152, merge=0/0, ticks=2415/217, in_queue=2631, util=52.94%
WARNING! PPN should be 16 but rescale's mpi implementation doesn't support it!
Using default -machinefile setting (/enc/uprod_wooKp/hosts)
MPI Application rank 14 killed before MPI_Init() with signal 15
getbw.value: 1342
getlat.value: 2144.895
log-1024m-write-job.p8510700: 
box.p8510700: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.p8510700: (groupid=0, jobs=1): err= 0: pid=8909: Mon Feb 26 17:35:08 2018
  write: IOPS=338k, BW=1320MiB/s (1384MB/s)(1024MiB/776msec)
    clat (nsec): min=1600, max=6199.4k, avg=2045.83, stdev=12283.70
     lat (nsec): min=1800, max=6199.5k, avg=2181.87, stdev=12294.16
    clat percentiles (nsec):
     |  1.00th=[  1704],  5.00th=[  1704], 10.00th=[  1800], 20.00th=[  1800],
     | 30.00th=[  1800], 40.00th=[  1800], 50.00th=[  1800], 60.00th=[  1800],
     | 70.00th=[  1896], 80.00th=[  1896], 90.00th=[  2288], 95.00th=[  3312],
     | 99.00th=[  4384], 99.50th=[  4896], 99.90th=[  9024], 99.95th=[ 10944],
     | 99.99th=[160768]
   bw (  MiB/s): min= 1247, max= 1247, per=94.55%, avg=1247.65, stdev= 0.00, samples=1
   iops        : min=319399, max=319399, avg=319399.00, stdev= 0.00, samples=1
  lat (usec)   : 2=82.28%, 4=15.30%, 10=2.35%, 20=0.05%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  lat (msec)   : 10=0.01%
  cpu          : usr=15.23%, sys=84.52%, ctx=6, majf=0, minf=38
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,262144,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1320MiB/s (1384MB/s), 1320MiB/s-1320MiB/s (1384MB/s-1384MB/s), io=1024MiB (1074MB), run=776-776msec

Disk stats (read/write):
    dm-1: ios=0/92, merge=0/0, ticks=0/142, in_queue=142, util=6.42%, aggrios=0/112, aggrmerge=0/0, aggrticks=0/109, aggrin_queue=109, aggrutil=6.15%
    dm-0: ios=0/112, merge=0/0, ticks=0/109, in_queue=109, util=6.15%, aggrios=0/112, aggrmerge=0/0, aggrticks=0/110, aggrin_queue=110, aggrutil=6.15%
  sdb: ios=0/112, merge=0/0, ticks=0/110, in_queue=110, util=6.15%
log-1024m-write-job.p8510701: 
box.p8510701: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.3
Starting 1 process

box.p8510701: (groupid=0, jobs=1): err= 0: pid=4384: Mon Feb 26 17:35:10 2018
  write: IOPS=349k, BW=1364MiB/s (1430MB/s)(1024MiB/751msec)
    clat (nsec): min=1600, max=387900, avg=1972.19, stdev=2814.96
     lat (nsec): min=1700, max=388000, avg=2107.92, stdev=2917.54
    clat percentiles (nsec):
     |  1.00th=[  1608],  5.00th=[  1704], 10.00th=[  1704], 20.00th=[  1704],
     | 30.00th=[  1704], 40.00th=[  1704], 50.00th=[  1800], 60.00th=[  1800],
     | 70.00th=[  1800], 80.00th=[  1800], 90.00th=[  2288], 95.00th=[  2704],
     | 99.00th=[  6176], 99.50th=[  6624], 99.90th=[  9664], 99.95th=[ 12992],
     | 99.99th=[179200]
   bw (  MiB/s): min= 1286, max= 1286, per=94.32%, avg=1286.12, stdev= 0.00, samples=1
   iops        : min=329247, max=329247, avg=329247.00, stdev= 0.00, samples=1
  lat (usec)   : 2=84.97%, 4=12.32%, 10=2.62%, 20=0.06%, 50=0.02%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=14.13%, sys=85.73%, ctx=10, majf=0, minf=35
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,262144,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1364MiB/s (1430MB/s), 1364MiB/s-1364MiB/s (1430MB/s-1430MB/s), io=1024MiB (1074MB), run=751-751msec